sicp_exercises_1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-13 Wed 19:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sicp练习题1</title>
<meta name="author" content="j56" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">sicp练习题1</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc0ad954">1. Chapter 1. Building Abstractions with Procedures <code>[12/14]</code></a>
<ul>
<li><a href="#orgfa3b72d">1.1. 1.1 The Elements of Programming</a>
<ul>
<li><a href="#org1f55eda">1.1.1. <span class="done DONE">DONE</span> Exercise 1.1 basics</a></li>
<li><a href="#orgafb7cc4">1.1.2. <span class="done DONE">DONE</span> Exercise 1.2 嵌套</a></li>
<li><a href="#orgad7178e">1.1.3. <span class="done DONE">DONE</span> Exercise 1.3</a></li>
<li><a href="#org26e3175">1.1.4. <span class="done DONE">DONE</span> Exercise 1.4 操作符也可以cond</a></li>
<li><a href="#orgc20f23f">1.1.5. <span class="done DONE">DONE</span> Exercise 1.5 理解正则序</a></li>
<li><a href="#org8436f1b">1.1.6. <span class="done DONE">DONE</span> Exercise 1.6 special form的执行序列问题</a></li>
<li><a href="#orga12806b">1.1.7. <span class="done DONE">DONE</span> Exercise 1.7 优化goods-enouth</a></li>
<li><a href="#orgc482edd">1.1.8. <span class="done DONE">DONE</span> Exercise 1.8 求立方根</a></li>
</ul>
</li>
<li><a href="#org62fad2c">1.2. 1.2 Procedures and the Processes They Generate</a>
<ul>
<li><a href="#orge6cd6ad">1.2.1. <span class="done DONE">DONE</span> Exercise 1.9 直观感受递归和迭代的不同</a></li>
<li><a href="#orgce94ca1">1.2.2. <span class="done DONE">DONE</span> Exercise 1.10 Ackermann 函数</a></li>
<li><a href="#orgc094c0f">1.2.3. <span class="done DONE">DONE</span> Exercise 1.11 分别用递归和迭代编写一个函数</a></li>
<li><a href="#orgb35439b">1.2.4. <span class="done DONE">DONE</span> Exercise 1.12 帕斯卡三角形</a></li>
<li><a href="#orga523a73">1.2.5. <span class="todo HOLD">HOLD</span> Exercise 1.13 证明斐波那契数列是最接近的整数&#xa0;&#xa0;&#xa0;<span class="tag"><span class="WAITING">WAITING</span>&#xa0;<span class="HOLD">HOLD</span></span></a></li>
<li><a href="#org3fbeca8">1.2.6. <span class="todo TODO">TODO</span> Exercise 1.14 分析找零钱的计算过程，分析时间和空间复杂度</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc0ad954" class="outline-2">
<h2 id="orgc0ad954"><span class="section-number-2">1.</span> Chapter 1. Building Abstractions with Procedures <code>[12/14]</code></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfa3b72d" class="outline-3">
<h3 id="orgfa3b72d"><span class="section-number-3">1.1.</span> 1.1 The Elements of Programming</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org1f55eda" class="outline-4">
<h4 id="org1f55eda"><span class="section-number-4">1.1.1.</span> <span class="done DONE">DONE</span> Exercise 1.1 basics</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
10
(+ 5 3 4)
(- 9 1)
(/ 6 2)
(+ (* 2 4) (- 4 6))
(define a 3)
(define b (+ a 1))
(+ a b (* a b))
(= a b)
(<span style="color: #51afef;">if</span> (<span style="color: #51afef;">and</span> (&gt; b a) (&lt; b (* a b)))
    b a)

(<span style="color: #51afef;">cond</span> ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))

(+ 2 (<span style="color: #51afef;">if</span> (&gt; b a) b a))

(* (<span style="color: #51afef;">cond</span> ((&gt; a b) a)
         ((&lt; a b) b)
         (else -1))

    (+ a 1))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgafb7cc4" class="outline-4">
<h4 id="orgafb7cc4"><span class="section-number-4">1.1.2.</span> <span class="done DONE">DONE</span> Exercise 1.2 嵌套</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
    (* 3 (- 6 2) (- 2 7)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad7178e" class="outline-4">
<h4 id="orgad7178e"><span class="section-number-4">1.1.3.</span> <span class="done DONE">DONE</span> Exercise 1.3</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Deﬁne a procedure
that takes three numbers as arguments and
returns the sum of the squares of the two
larger numbers.
</p>

<div class="org-src-container">
<pre class="src src-scheme">
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sum-of-squares</span> x y)
  (+ (* x x) (* y y)))
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">&gt;=</span> x y) (not (&lt; x y)))
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">exe-1.3</span> x y z)
  [cond ((<span style="color: #51afef;">and</span> (&gt;= x y) (&gt;= y z)) (sum-of-squares x y))
        ((<span style="color: #51afef;">and</span> (&gt;= x y) (&gt;= z y)) (sum-of-squares x z))
        ((<span style="color: #51afef;">and</span> (&gt;= y x) (&gt;= x z)) (sum-of-squares y x))
        ((<span style="color: #51afef;">and</span> (&gt;= y x) (&gt;= z x)) (sum-of-squares y z))
        ((<span style="color: #51afef;">and</span> (&gt;= z x) (&gt;= y x)) (sum-of-squares z y))
        ((<span style="color: #51afef;">and</span> (&gt;= z x) (&gt;= x y)) (sum-of-squares x z))
        ]
  )

(&gt;= 3 2)
(exe-1.3 1 2 3)
(exe-1.3 1 2 2)
(exe-1.3 2 2 1)


</pre>
</div>
</div>
</div>
<div id="outline-container-org26e3175" class="outline-4">
<h4 id="org26e3175"><span class="section-number-4">1.1.4.</span> <span class="done DONE">DONE</span> Exercise 1.4 操作符也可以cond</h4>
<div class="outline-text-4" id="text-1-1-4">
<pre class="example">
(define (a-plus-abs-b a b)
   ((if (&gt; b 0) + -) a b))

(a-plus-abs-b 1 2)
(a-plus-abs-b 1 -2)

</pre>
</div>
</div>
<div id="outline-container-orgc20f23f" class="outline-4">
<h4 id="orgc20f23f"><span class="section-number-4">1.1.5.</span> <span class="done DONE">DONE</span> Exercise 1.5 理解正则序</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Ben Bitdiddle has invented a test to determine
whether the interpreter he is faced with is using
applicativeorder evaluation or normal-order
evaluation. He deﬁnes the following two procedures:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">p</span>) (p))
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">test</span> x y)
  (<span style="color: #51afef;">if</span> (= x 0) 0 y))
</pre>
</div>


<p>
(test 0 (p)) 直接死循环了
这里用了app order的话，会先对param求值，(p)本身就是死循环
如果用了正则序，则不会求值，会一直expend，(p)不会被执行，则返回0
<a href="https://www.cnblogs.com/ssaylo/p/13633403.html">https://www.cnblogs.com/ssaylo/p/13633403.html</a>
另外，哪里有答案呐：<a href="http://community.schemewiki.org/?SICP-Solutions">http://community.schemewiki.org/?SICP-Solutions</a>
随便一下就搜到了
</p>
</div>
</div>

<div id="outline-container-org8436f1b" class="outline-4">
<h4 id="org8436f1b"><span class="section-number-4">1.1.6.</span> <span class="done DONE">DONE</span> Exercise 1.6 special form的执行序列问题</h4>
<div class="outline-text-4" id="text-1-1-6">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">improve</span> guess x)
  (average guess (/ x guess)))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">average</span> x y)
  (/ (+ x y) 2))
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">good-enough?</span> guess x)
  (&lt; (abs (- (square guess) x)) 0.001))


(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sqrt</span> x)
  (sqrt-iter 1.0 x))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">new-if</span> predicate then-clause else-clause)
  (<span style="color: #51afef;">cond</span> (predicate then-clause)
        (<span style="color: #51afef;">else</span> else-clause)))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#36825;&#20010;&#30452;&#25509;&#27515;&#24490;&#29615;&#20102;&#65292;&#21306;&#21035;&#23601;&#26159; if &#21644; new-if</span>
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sqrt-iter2</span> guess x)
  (new-if (good-enough? guess x)
          guess
          (sqrt-iter2 (improve guess x) x)))
</pre>
</div>

<p>
解释如下：原始的if 是 spcial-form，执行按照应用序处理，
因此只会计算多个参数中的一个，新定义的 new-if是正则序的，
会将所有的param求值，因此会陷入死循环中无法脱出
</p>

<p>
一个更直观的例子
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">iff</span> <span style="color: #ECBE7B;">&lt;p&gt;</span> <span style="color: #ECBE7B;">&lt;c&gt;</span> <span style="color: #ECBE7B;">&lt;a&gt;</span>) (<span style="color: #51afef;">if</span> <span style="color: #ECBE7B;">&lt;p&gt;</span> <span style="color: #ECBE7B;">&lt;c&gt;</span> <span style="color: #ECBE7B;">&lt;a&gt;</span>))
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">tryif</span> a) (<span style="color: #51afef;">if</span> (= a 0) 1 (/ 1 0))) 
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">tryiff</span> a) (iff (= a 0) 1 (/ 1 0)))
</pre>
</div>

<pre class="example">
Welcome to DrRacket, version 7.5 [3m].
Language: R5RS; memory limit: 128 MB.
&gt; (tryif 0)
1
&gt; (tryif 1)
. . /: division by zero
&gt; (tryiff 0)
. . /: division by zero
&gt; (tryiff 1)
. . /: division by zero
&gt; 
</pre>
<p>
可以看到，执行到 tryiff 0的时候，也返回了不符合的结果，证明已经执行了param中的内容
</p>
</div>
</div>
