sicp_exercises_1.org
*** DONE Exercise 1.7 优化goods-enouth
CLOSED: [2024-03-06 Wed 18:25]

上面的方法，在数字特别小，或者特别大的情况下，执行的不给力，会死循环
比如

#+begin_src
Welcome to Racket v8.4 [cs].
> (sqrt 300000000000000000000000000000000000)
  C-c C-c; user break [,bt for context]
  
#+end_src

这是原来的一系列方法
#+begin_src scheme

(define (square x)
  (* x x))

(define (sqrt-iter guess x)
  (if (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x) x)))

(define (improve guess x)
  (average guess (/ x guess)))

(define (average x y)
  (/ (+ x y) 2))
(define (good-enough? guess x)
  (< (abs (- (square guess) x)) 0.001))


(define (sqrt x)
  (sqrt-iter 1.0 x))

#+end_src

#+begin_src scheme
  
(define (square x)
  (* x x))

(define (sqrt-iter guess x)
  (define guess_n (improve guess x))
  (if (good-enough? guess_n guess)
      guess_n
      (sqrt-iter guess_n x)))

(define (improve guess x)
  (average guess (/ x guess)))

(define (average x y)
  (/ (+ x y) 2))
(define (good-enough? guess_n guess)
  (< (abs (- guess_n guess)) 0.00001))


(define (sqrt x)
  (sqrt-iter 1.0 x))

#+end_src

改写完成之后，可以发现，执行运算成功了

#+begin_src
> (sqrt 300000000000000000000000000000000000)
547722557505166100.0
> 

#+end_src

*** DONE Exercise 1.8 求立方根
CLOSED: [2024-03-06 Wed 18:25]

已经给出了函数概念了，实现就比较简单

$$\frac{x/y^2 + 2y }{3}$$

#+begin_src scheme

  (define (cube x)
    (define (cube-iter guess)
      (if (goods-enouth? guess)
          guess
          (cube-iter (improve guess))))
  
    (define (goods-enouth? guess)
     (< (abs (- (* guess guess guess) x)) 0.001)
     )

    (define (improve guess)
      (/ (+ (/ x (* guess guess)) (* 2 guess)) 3))
   (cube-iter 1.0)
   )

;; cases
  (cube 9)
  (cube 8)
  (cube 10)
  (cube 27)
  (cube 81)
  (cube 1000)
  (cube 0.001)

#+end_src
** 1.2 Procedures and the Processes They Generate
*** TODO Exercise 1.9 直观感受递归和迭代的不同

#+begin_src scheme
    (define (+ a b)
     (if ( = a 0)
         b
         (inc (+ (dec a) b)))
  )

;; (++ 4 5)
;; (inc (++ 3 5)))
;; (inc (inc (++ 2 5)))
;; (inc (inc (inc (++ 1 5))))
;; (inc (inc (inc (inc (++ 0 5)))))
;; (inc (inc (inc (inc (5)))))
;; (inc (inc (inc (6))))
;; (inc (inc 7))
;; (inc 8)
;; 9
  
#+end_src


#+begin_src scheme
    (define (+ a b)
     (if ( = a 0)
     b
     (+ (dec a) (inc b))))

  ;;(++ 4 5)
  ;;(++ 3 6)
  ;;(++ 2 7)
  ;;(++ 1 8)
  ;;(++ 0 9)
  ;;9
#+end_src

The easiest way to spot that the first process is recursive (without writing out the substitution) is to note that the "+" procedure calls itself at the end while nested in another expression; the second calls itself, but as the top expression.

*** DONE Exercise 1.10 Ackermann 函数
CLOSED: [2024-02-24 Sat 17:49]
#+begin_src scheme
(define (A x y)
   (cond ((= y 0) 0)
         ((= x 0) (* 2 y))
         ((= y 1) 2)
         (else (A (- x 1) (A x (- y 1))))))
#+end_src

阿克曼函数，增长非常快，通过模型代换看下内容

#+begin_src scheme
;;(A 1 2)
;;((A 0 (A 1 1))
;;((A 0 2))
;;(* 2 2)
;;4

#+end_src

#+begin_src scheme
;;(A 1 4）
;;(A 0 (A 1 3))
;;(A 0 (A 0 (A 1 2)))
;;(A 0 (A 0 (A 0 (A 1 1)))
;;(A 0 (A 0 (A 0 2))
;;(A 0 (A 0 4))
;;(A 0 8)
;;16
#+end_src

可以看到，在 =(g n) = (A 1 n)= 中，基本上，函数的内容为 $2^n$

同理，计算 =(f n) =(A 0 n)= 其实就等于 $2n$

看下 =(A 2 n)=的话，

#+begin_src scheme
;;(A 2 3)
;;(A 1 (A 2 2))
;;(A 1 (A 1 (A 2 1)))
;;(A 1 (A 1 2))
;;(A 1 (A 0 (A 1 1)))
;;(A 1 (A 0 (A 1 1)))
;;(A 1 (A 0 2))
;;(A 1 4)
#+end_src

首先，=(A 2 n)= 会完全变成 多个(A 1 n)

#+begin_src scheme
(A 2 4)
(A 1 (A 2 3))
(A 1 (A 1 (A 2 2)))
(A 1 (A 1 (A 1 (A 2 1))))
(A 1 (A 1 (A 1 2)))
(A 1 (A 1 (A 0 (A 1 1))))
(A 1 (A 1 (A 0 2)))
(A 1 (A 1 4))
(A 1 (A 0 (A 1 3)))
(A 1 (A 0 (A 0 (A 1 2))))
(A 1 (A 0 (A 0 (A 0 (A 1 1)))))
(A 1 (A 0 (A 0 (A 0 2))))
(A 1 (A 0 (A 0 4)))
(A 1 (A 0 8))
(A 1 16)

#+end_src

答案中的 =(define (h n) (A 2 n))= 相当于是 $2^(2^(2^(2...(n times)))) for n>1$

