sicp_exercises_1.html
<div id="outline-container-orga12806b" class="outline-4">
<h4 id="orga12806b"><span class="section-number-4">1.1.7.</span> <span class="done DONE">DONE</span> Exercise 1.7 优化goods-enouth</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
上面的方法，在数字特别小，或者特别大的情况下，执行的不给力，会死循环
比如
</p>

<pre class="example">
Welcome to Racket v8.4 [cs].
&gt; (sqrt 300000000000000000000000000000000000)
  C-c C-c; user break [,bt for context]

</pre>

<p>
这是原来的一系列方法
</p>
<div class="org-src-container">
<pre class="src src-scheme">
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">square</span> x)
  (* x x))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sqrt-iter</span> guess x)
  (<span style="color: #51afef;">if</span> (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x) x)))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">improve</span> guess x)
  (average guess (/ x guess)))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">average</span> x y)
  (/ (+ x y) 2))
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">good-enough?</span> guess x)
  (&lt; (abs (- (square guess) x)) 0.001))


(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sqrt</span> x)
  (sqrt-iter 1.0 x))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">square</span> x)
  (* x x))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sqrt-iter</span> guess x)
  (<span style="color: #51afef;">define</span> <span style="color: #c678dd;">guess_n</span> (improve guess x))
  (<span style="color: #51afef;">if</span> (good-enough? guess_n guess)
      guess_n
      (sqrt-iter guess_n x)))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">improve</span> guess x)
  (average guess (/ x guess)))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">average</span> x y)
  (/ (+ x y) 2))
(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">good-enough?</span> guess_n guess)
  (&lt; (abs (- guess_n guess)) 0.00001))


(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sqrt</span> x)
  (sqrt-iter 1.0 x))

</pre>
</div>

<p>
改写完成之后，可以发现，执行运算成功了
</p>

<pre class="example">
&gt; (sqrt 300000000000000000000000000000000000)
547722557505166100.0
&gt; 

</pre>
</div>
</div>

<div id="outline-container-orgc482edd" class="outline-4">
<h4 id="orgc482edd"><span class="section-number-4">1.1.8.</span> <span class="done DONE">DONE</span> Exercise 1.8 求立方根</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
已经给出了函数概念了，实现就比较简单
</p>

<p>
\[\frac{x/y^2 + 2y }{3}\]
</p>

<div class="org-src-container">
<pre class="src src-scheme">
  (<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">cube</span> x)
    (<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">cube-iter</span> guess)
      (<span style="color: #51afef;">if</span> (goods-enouth? guess)
          guess
          (cube-iter (improve guess))))

    (<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">goods-enouth?</span> guess)
     (&lt; (abs (- (* guess guess guess) x)) 0.001)
     )

    (<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">improve</span> guess)
      (/ (+ (/ x (* guess guess)) (* 2 guess)) 3))
   (cube-iter 1.0)
   )

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">cases</span>
  (cube 9)
  (cube 8)
  (cube 10)
  (cube 27)
  (cube 81)
  (cube 1000)
  (cube 0.001)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org62fad2c" class="outline-3">
<h3 id="org62fad2c"><span class="section-number-3">1.2.</span> 1.2 Procedures and the Processes They Generate</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orge6cd6ad" class="outline-4">
<h4 id="orge6cd6ad"><span class="section-number-4">1.2.1.</span> <span class="done DONE">DONE</span> Exercise 1.9 直观感受递归和迭代的不同</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-scheme">    (<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">+</span> a b)
     (<span style="color: #51afef;">if</span> ( = a 0)
         b
         (inc (+ (dec a) b)))
  )

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(++ 4 5)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(inc (++ 3 5)))</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(inc (inc (++ 2 5)))</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(inc (inc (inc (++ 1 5))))</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(inc (inc (inc (inc (++ 0 5)))))</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(inc (inc (inc (inc (5)))))</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(inc (inc (inc (6))))</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(inc (inc 7))</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(inc 8)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">9</span>

</pre>
</div>


<div class="org-src-container">
<pre class="src src-scheme">  (<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">+</span> a b)
   (<span style="color: #51afef;">if</span> ( = a 0)
   b
   (+ (dec a) (inc b))))

<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(++ 4 5)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(++ 3 6)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(++ 2 7)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(++ 1 8)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(++ 0 9)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">9</span>
</pre>
</div>

<p>
The easiest way to spot that the first process is recursive (without writing out the substitution) is to note that the "+" procedure calls itself at the end while nested in another expression; the second calls itself, but as the top expression.
</p>
</div>
</div>

<div id="outline-container-orgce94ca1" class="outline-4">
<h4 id="orgce94ca1"><span class="section-number-4">1.2.2.</span> <span class="done DONE">DONE</span> Exercise 1.10 Ackermann 函数</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">A</span> x y)
   (<span style="color: #51afef;">cond</span> ((= y 0) 0)
         ((= x 0) (* 2 y))
         ((= y 1) 2)
         (<span style="color: #51afef;">else</span> (A (- x 1) (A x (- y 1))))))
</pre>
</div>

<p>
阿克曼函数，增长非常快，通过模型代换看下内容
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 2)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">((A 0 (A 1 1))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">((A 0 2))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(* 2 2)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">4</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 4&#65289;</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 0 (A 1 3))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 0 (A 0 (A 1 2)))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 0 (A 0 (A 0 (A 1 1)))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 0 (A 0 (A 0 2))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 0 (A 0 4))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 0 8)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">16</span>
</pre>
</div>

<p>
可以看到，在 <code>(g n) = (A 1 n)</code> 中，基本上，函数的内容为 \(2^n\)
</p>

<p>
同理，计算 <code>(f n) =(A 0 n)</code> 其实就等于 \(2n\)
</p>

<p>
看下 =(A 2 n)=的话，
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 2 3)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 (A 2 2))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 (A 1 (A 2 1)))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 (A 1 2))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 (A 0 (A 1 1)))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 (A 0 (A 1 1)))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 (A 0 2))</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(A 1 4)</span>
</pre>
</div>

<p>
首先，=(A 2 n)= 会完全变成 多个(A 1 n)
</p>

<div class="org-src-container">
<pre class="src src-scheme">(A 2 4)
(A 1 (A 2 3))
(A 1 (A 1 (A 2 2)))
(A 1 (A 1 (A 1 (A 2 1))))
(A 1 (A 1 (A 1 2)))
(A 1 (A 1 (A 0 (A 1 1))))
(A 1 (A 1 (A 0 2)))
(A 1 (A 1 4))
(A 1 (A 0 (A 1 3)))
(A 1 (A 0 (A 0 (A 1 2))))
(A 1 (A 0 (A 0 (A 0 (A 1 1)))))
(A 1 (A 0 (A 0 (A 0 2))))
(A 1 (A 0 (A 0 4)))
(A 1 (A 0 8))
(A 1 16)

</pre>
</div>

<p>
答案中的 <code>(define (h n) (A 2 n))</code> 相当于是 \(2^(2^(2^(2...(n times)))) for n>1\)
</p>
</div>
</div>
